local function run(msg, matches)
local telediamondsudo = [[
➖➖➖➖➖➖➖
》Sudo Help
》for TeleDiamon
➖➖➖➖➖➖➖
ߒ¡add
❔نصب ربات در گروه
ߒ¡rem
❔حذف ربات از گروه
ߒ¡leave
❔خروج ربات از گروه
ߒ¡creategroup (GPname)
❔ساختن گروه
ߒ¡createsuper (GPname)
❔ساختن سوپر گروه
ߒ¡banall @username
❔بن از لیست گروهای ربات
ߒ¡unbanall @username
❔خارج کردن از بن لیست
ߒ¡tosuper
❔تبدیل گپ به سوپر گپ
ߒ¡addcontact id firstname lastname
❔افزودن کاربر به مخاطبین اکانت ربات
ߒ¡remcontact id firstname lastname
❔حذف کاربر از تیم پشتیبانی
ߒ¡import (link)
❔وارد شدن ربات به گروه با لینک
ߒ¡setexpire (day)
❔تنظیم تاریخ انقضای گروه
ߒ¡p + plugname
❔فعال کردن پلاگین
ߒ¡p - plugname
❔غیرفعال کردن پلاگین
ߒ¡save plugname
❔افزودن پلاگین با ریپلی
ߒ¡delplugin plugname
❔حذف پلاگین
(قبلا حذف پلاگین را غیرفعال کنید)
ߒ¡reload
❔ریلود پلاگین ها
ߒ¡broadcast (text)
❔ارسال پیام به همه گروها
ߒ¡markread (on/off)
❔تنظیم رید شدن پیام ها توسط ربات
ߒ¡serverinfo
❔مشخصات سرور
ߒ¡setsudo
❔ارتقای مقام کاربری به عنوان سودو
ߒ¡remsudo
❔تنزل مقام کاربر از مقام سودو
@wolf_chaneel
 ]]
local telediamond = [[
➖➖➖➖➖➖➖
✔️لیست دستورات مدیریتی
➖➖➖➖➖➖➖ 
ߒ£#حذف پیام ها (1-200)
❔حذف پیام های اخیر سوپرگروه
ߒ£#اینفو
❔اطلاعات شما و گروه
 
ߒ£#اعضای گروه
❔لیست اعضای گروه
ߒ£#ادمین ها
❔لیست ادمین های گروه
ߒ£#لیست مدیران
❔لیست مدیران ربات
ߒ£#اخراج (ایدی یا ریپلی)
❔اخراج کاربری از گروه
ߒ£#بن (ایدی یا ریپلی)
❔ممنوع کردن کاربر از گروه
ߒ£#خ بن (ایدی)
❔خارج کردن از ممنوعیت از گروه
ߒ£#لیست بن
❔لیست افرادی که از گروه بن شده اند
ߒ£#ایدی
❔ایدی عددی شما
ߒ£#مدیر (ایدی یا ریپلی)
❔ارتقای رتبه کاربر به عنوان مدیر ربات
ߒ£#تنزل مدیر (ایدی یا ریپلی)
❔تنزل رتبه مدیر به عنوان ممبر معمولی
 
ߒ£#ادمین (ایدی یا ریپلی)
❔ارتقای رتبه کاربر به عنوان مدیر گروه
ߒ£#تنزل ادمین (ایدی یا ریپلی)
❔تنزل رتبه ادمین به عنوان ممبر معمولی
ߒ£#نشاندن اسم (نام گروه)
❔نشاندن اسم برای گروه
ߒ£#نشاندن عکس
❔نشاندن عکس برای گروه
ߒ£#لینک
❔گرفتن لینک گروه
ߒ£#لینک جدید
❔ساختن لینک جدید برای گروه
ߒ£#نشاندن لینک
❔نشاندن لینک گروه
ߒ£#قوانین
❔نمایش قوانین گروه
ߒ£#نشاندن قوانین (قوانین گروه)
❔تعیین قوانین گروه
ߒ£#صامت (ایدی یا ریپلی)
❔ساکت کردن کاربری خاص
ߒ£#مصوت (ایدی یا ریپلی)
❔صدادارکردن کاربری خاص(خارج کردن از صامت)
ߒ£#لیست صامت شدگان
❔نمایش لیست افرادی که صامت شده اند
ߒ£#تنظیم حساسیت (5-20)
❔تنظیم حساسیت به اسپم
ߒ£#تنظیمات
❔نمایش تنظیمات گروه
ߒ£#حذف (قوانین ، درباره گروه ، لیست مدیران ، لیست صامت شدگان ، لیست فیلتر)
❔حذف هر یک از موارد داخل پرانتز
ߒ£#صاحب (ایدی یا ریپلی)
❔ارتقای کاربر به عنوان صاحب ربات
(صاحب ربات تنزل رتبه میابد)
ߒ£#ربات ها
❔لیست ربات های گروه
ߒ£#عمومی (باشد یا نباشد)
❔تنظیم عمومی بودن گروه
ߒ£#حذف دیلیت اکانتی ها
❔حذف کسانی که حساب کاربری خود را حذف کرده اند
➰شما میتوانید برای اجرای دستورات از '/' یا '!' یا '#' و یا بدون هیچ علائم استفاده کنید.
@wolf_chaneel
 ]]
local telediamond2 = [[
➖➖➖➖➖➖➖
✔️لیست دستورات قفلی:
➖➖➖➖➖➖➖
❌》قفل لینک
✔️》بازکردن لینک
〽️در صورت قفل اگر ممبرها لینکی ارسال کنند لینک حذف خواهدشد.
❌》قفل استیکر
✔️》بازکردن استیکر
〽️درصورت قفل ارسال استیکر ممنوع میشود.
❌》قفل عربی
✔️》بازکردن عربی
〽️درصورت قفل چت عربی ممنوع میشود.
❌》قفل مخاطب ها
✔️》بازکردن مخاطب ها
〽️درصورت قفل ارسال مخاطب (شرکردن شماره)ممنوع میشود.
❌》قفل اسپم
✔️》بازکردن اسپم
〽️درصورت قفل کاربران با دادن اسپم(هرزنامه)از گروه حذف خواهند شد.
❌》قفل ورودوخروج
✔️》بازکردن ورودوخروج
〽️درصورت قفل ورود و خروج اعضا نمایش داده نمیشود.
❌》قفل سختگیرانه
✔️》بازکردن سختگیرانه
〽️درصورت قفل اگر کاربری خلاف قوانین عمل کند از گروه حذف میشود.(مثلا اگرلینک قفل باشد کاربر با دادن لینک از گروه حذف میشود)
❌》قفل ممبر
✔️》بازکردن ممبر
〽️درصورت قفل ورود و خروج به گروه ممنوع میشود.(درصورت ورود از گروه حذف و درصورت خروج بن میشود)
❌》قفل فلود
✔️》بازکردن فلود
〽️درصورت قفل دادن پی ام پشت سرهم و تکراری در گروه ممنوع میشود.
❌》قفل ربات ها
✔️》بازکردن ربات ها
〽️درصورت قفل اد کردن ربات در گروه ممنوع میشود.
❌》قفل فوروارد
✔️》بازکردن فوروارد
〽️درصورت قفل فوروارد کردن در گروه ممنوع میشود.
❌》قفل  تگ
✔️》بازکردن تگ
〽️درصورت قفل ارسال تگ(#) و یوزرنیم(@) در گروه ممنوع میشود.
 
〰 قفل 》ممنوعیت
❌》قفل متن
✔️》بازکردن متن
❌》قفل عکس
✔️》بازکردن عکس
❌》قفل فایل
✔️》بازکردن فایل
❌》قفل فیلم
✔️》بازکردن فیلم
❌》قفل آهنگ
✔️》بازکردن آهنگ
@wolf_chaneel
 ]]
local telediamond3 = [[
➖➖➖➖➖➖➖
✔️لیست دستورات فان:
➖➖➖➖➖➖➖
ߒ£#استیکر
❔تبدیل عکس به استیکر با ریپلی بر روی عکس
ߒ£#عکس
❔تبدیل استیکر به عکس با ریپلی برروی استیکر
ߒ£#گیف
❔تبدیل ویدیو به گیف با ریپلی بر روی ویدیو
ߒ£#آهنگ 
❔تبدیل وویس به اهنگ با ریپلی بر روی وویس
ߒ£#فیلم
❔تبدیل گیف به ویدیو با ریپلی بر روی گیف
ߒ£#وویس (متن)
❔تبدیل متن به وویس
ߒ£#هواشناسی (شهر)
❔هواشناسی(بجای شهر نام شهر مورد نظر را به انگلیسی بنویسید)
ߒ£#زمان
❔زمان بصورت استیکر
ߒ£#گیف (کلمه)
❔کلمه یا اسم شما بصورت گیف
ߒ£#ماشین حساب عدد(+-/*^)عدد
❔حساب اعمال اصلی ریاضی
➰بجای کلمه یا متن موارد دلخواه خود را بنویسید.
@wolf_chaneel
 ]]
local telediamond4 = [[
✔️لیست دستورات مدیریتی سوپر گروه:
ߔѣinfo
〽️نمایش اطلاعات کلی در مورد سوپر گروه
ߔѣsetlang (fa,en)
〽️تعیین زبان گروه(fa=فارسی-en=انگلیسی)
ߔѣwho
〽️لیست کاربران گروه
ߔѣadmins
〽️لیست مدیران گروه
ߔѣmodlist
〽️لیست مدیران ربات
ߔѣkick @username
〽️اخراج کاربر از گروه با آیدی یا ریپلی
ߔѣinvite @username
〽️دعوت کاربر به گروه
ߔѣban @username
〽️بن کردن کاربر با آیدی یا ریپلی
ߔѣunban
〽️خارج کردن کاربر از بن لیست با آیدی یا ریپلی
ߔѣid
〽️نمایش آیدی شما و آیدی سوپر گروه
ߔѣid from
〽️گرفتن آیدی از پیام فوروارد شده با ریپلی
ߔѣpromote @username
〽️ترفیع رتبه کاربر به عنوان مدیر گروه با آیدی یا ریپلی
ߔѣdemote @username
〽️تنزل‌ رتبه مدیر به ممبر معمولی گروه با آیدی یا ریپلی
ߔѣsetname (groupname)
〽️تعیین نام گروه
ߔѣsetphoto
〽️تعیین عکس گروه
ߔѣnewlink
〽️ساخت لینک جدید برای گروه
ߔѣsetlink
〽️نشاندن لینک برای گروه
(بعد از زدن دستور لینک گروه را ارسال کنید.)
ߔѣlink
〽️گرفتن لینک گروه
ߔѣrules
〽️نمایش قوانین گروه
ߔѣsetrules text
〽️تعیین قوانین گروه
ߔѣmuteall (min)
〽️صامت کردن گروه برای زمانی خاص
ߔѣunmuteall
〽️خارج کردن از صامت
ߔѣsetflood [value]
〽️تنظیم حساسیت اسپم(جای [value] عددی بین 1-20قراردهید)
ߔѣsettings
〽️تنظیمات گروه
ߔѣsilent @username
〽️ساکت کردن کاربری با آیدی یا ریپلی
ߔѣunsilent @username
〽️خارج کردن کاربر از لیست صامت با آیدی یا ریپلی
ߔѣsilentlist
〽️لیست افراد صامت شده
ߔѣbanlist
〽️لیست افراد بن شده
ߔѣfilterlist
〽️لیست کلمات فیلتر
ߔѣmutelist
〽️لیست افراد صامت
ߔѣclean [rules|about|modlist|silentlist|filterlist]
〽️پاک کردن ߔřȘǙƛ̙ƠߔŘǘיĘǘ٘ǘʠߔřě̘Әʠمدیران ߔřě̘Әʠکاربران صامت ߔřě̘Әʠکلمات فیلتر
ߔѣrmsg [value]
〽️حذف پیام های اخیر گروه (جای value عددی بین 1-200)
✨توضیحات:
➰جای @username آیدی کاربر را قرار بدید.
➰با ریپلی یعنی بر روی پیام کاربر ریپلی(جواب دادن)کرده و دستور را وارد کنید.
@wolf_chaneel
 ]]
local telediamond5 = [[
✔️لیست دستورات فان سوپر گروه:
ߔѣsticker
〽️تبدیل عکس به استیکر با ریپلی بر روی عکس
ߔѣphoto
〽️تبدیل استیکر به عکس با ریپلی برروی استیکر
ߔѣpng
〽️تبدیل عکس به فرمت png
ߔѣgif
〽️تبدیل ویدیو به گیف با ریپلی بر روی ویدیو
ߔѣaudio 
〽️تبدیل وویس به اهنگ با ریپلی بر روی وویس
ߔѣvideo
〽️تبدیل گیف به ویدیو با ریپلی بر روی گیف
ߔѣvoice text
〽️تبدیل متن به وویس
ߔѣweather city
〽️هوا شناسی(بجای city نام شهر مورد نظر را بنویسید)
ߔѣtime
〽️زمان بصورت استیکر
ߔѣmean text
〽معنی کلمات انگلیسی٬ و فارسی ومعنی اسامی فارسی
✨بجای text کلمه مورد نظر خود را بنویسید.
✨متن به عکس
!conv متن
@wolf_chaneel
 ]]
local telediamond6 = [[
✔️لیست دستورات قفلی سوپر گروه:
ߔѣlock text 
ߔѣunlock text
1)✖️links
2)✖️flood
3)✖️spam
4)✖️Arabic
5)✖️member
6)✖️sticker
7)✖️contacts
8)✖️strict
9)✖️tag
10)✖️fwd
11)✖️tgservice
12)✖️media
13)✖️bots
14)✖️edit
 〽️قفل کردن
〽️باز کردن قفل
1)✖️لینک
2)✖️پی ام تکراری
3)✖️اسپم
4)✖️عربی
5)✖️عضو
6)✖️استیکر
7)✖️مخاطب ها
8)✖️سخت گیری
9)✖️یوزرنیم و‌هشتگ
10)✖️فوروراد
11)✖️نمایش ورود و خروج
12)✖️رسانه(عکس و فیلم و...)
13)✖️ربات ها
14)✖️ویرایش پیام
ߌߘȘ̘Ǜ̠text گزینه مورد نظرتان را قرار بدین(گزینه های انگلیسی)
 با قفل هر کدام انجام یا فرستادن آن در گروه ممنوع میشود.
✨توضیحات:
➰قفل لینک:با قفل لینک ارسال لینک در گروه برای ممبرها ممنوع میشود
➰قفل اسپم:با قفل اسپم کسی قادر به خراب کردن گروه نخواهد بود و در صورت دادن پی ام پشت سرهم برای خراب کردن گروه خودکار خواهد شد.
➰قفل عضو:کسی قادر به ورود به گروه نخواهد بود
➰قفل سخت گیری:در صورتی که یکی از گزینه های بالا قفل باشد کاربر با انجام آن خودکار حذف میشود.
مثلا وقتی لینک قفل باشد درصورتی که کاربر لینک ارسال کند هم لینک و هم کاربر در صورت قفل بودن سخت گیری حذف خواهند شد.
@wolf_chaneel
 ]]
local telediamond7 = [[
̴D̴̴i̴̴a̴̴m̴̴o̴̴n̴̴d̴ ̴C̴̴o̴̴m̴̴m̴̴a̴̴n̴̴d̴̴s̴ :
✔️برای دیدن دستورات مورد نظر خود مورد دلخواه را ارسال کنید :
➰دستورات فارسی:
☆دستورات قفلی
ߎף#راهنمای قفلی
☆دستورات فان
ߎף#راهنمای فان
☆دستورات مدیریتی
ߎף#راهنمای مدیریتی
➖➖➖➖➖➖➖
➰English Commands:
☆دستورات قفلی
ߎף#lockhelp
☆دستورات فان
ߎף#funhelp
☆دستورات مدیریتی
ߎף#modhelp
 @wolf_chaneel
TeleDiamond V4
]]
    if matches[1] == 'راهنمای مدیریتی' and is_momod(msg) then
        return telediamond  
  elseif matches[1] == 'sudohelp' and is_sudo(msg) or matches[1] == 'راهنمای سودو' and is_sudo(msg) then
    return telediamondsudo
  elseif matches[1] == 'راهنمای قفلی' and is_momod(msg) then
    return telediamond2
  elseif matches[1] == 'راهنمای فان' and is_momod(msg) then
    return telediamond3
  elseif matches[1] == 'modhelp' and is_momod(msg) then
    return telediamond4
  elseif matches[1] == 'funhelp' and is_momod(msg) then
    return telediamond5
  elseif matches[1] == 'lockhelp' and is_momod(msg) then
    return telediamond6
  elseif matches[1] == 'help' and is_momod(msg) or matches[1] == 'راهنما' and is_momod(msg) then
    return telediamond7
  end
end

return {
      description = '',
      usage = '',
      patterns = {
    '^[!#/](راهنمای مدیریتی)$',
    '^[!#/](modhelp)$',
    '^[!#/](راهنمای قفلی)$',
    '^[!#/](lockhelp)$',
  '^[!#/](راهنمای فان)$',
    '^[!#/](funhelp)$',
    '^[!#/](help)$',
  '^[!#/](راهنما)$',
    '^[!#/](sudohelp)$',
  '^[!#/](راهنمای سودو)$',
    @wolf_chaneel    
 },
      run = run,
}
